brew "pure"

cask "visual-studio-code"
cask "sublime-merge"
cask "dotnet-sdk"
cask "steipete/tap/codexbar"

brew "coreutils"
brew "stow"

brew "git"
brew "gh"
brew "1password-cli"
brew "lsd"
brew "fnm"
brew "yarn"
brew "uv"

brew "difftastic"
brew "mergiraf"

brew "make"
brew "cmake"

brew "python3"
brew "swiftlint"

cask "font-jetbrains-mono-nerd-font"
