brew "pure"

cask "visual-studio-code"
cask "1password-cli"
cask "sublime-merge"
cask "dotnet-sdk"
cask "steipete/tap/codexbar"

brew "coreutils"
brew "stow"

brew "git"
brew "gh"
brew "lsd"
brew "fnm"
brew "yarn"
brew "uv"

brew "difftastic"
brew "mergiraf"

brew "make"
brew "cmake"

brew "python3"
brew "swiftlint"

## Terminal
cask "ghostty"
brew "fish"
brew "fisher"
brew "zellij"
brew "starship"

## Coding Agents
brew "codex"

brew "beads"

tap "dot-agents/tap"
brew "dot-agents/tap/dot-agents"

tap "atlassian/homebrew-acli"
brew "atlassian/homebrew-acli/acli"

## Fonts
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"

cask "font-fira-code"
cask "font-fira-code-nerd-font"

## PHP
tap "shivammathur/php"
brew "shivammathur/php/php@5.6"
brew "shivammathur/php/php@7.0"
brew "shivammathur/php/php@8.4"

tap "shivammathur/extensions"
brew "shivammathur/extensions/ssh2@8.4"
