brew "pure"

cask "visual-studio-code"
cask "1password-cli"
cask "sublime-merge"
cask "dotnet-sdk"
cask "steipete/tap/codexbar"

brew "coreutils"
brew "stow"

brew "git"
brew "git-lfs"
brew "gh"
brew "lsd"
brew "fnm"
brew "yarn"
brew "uv"

brew "smimesign"
brew "difftastic"
brew "mergiraf"

brew "make"
brew "cmake"

brew "python3"
brew "swiftlint"

## Terminal
cask "ghostty"
brew "fish"
brew "fisher"
brew "zellij"
brew "starship"

## Coding Agents
cask "codex"

brew "beads"

tap "atlassian/homebrew-acli", trusted: true
brew "atlassian/homebrew-acli/acli", trusted: true

## Fonts
cask "font-jetbrains-mono"
cask "font-jetbrains-mono-nerd-font"

cask "font-fira-code"
cask "font-fira-code-nerd-font"

## PHP
tap "shivammathur/php", trusted: true
brew "shivammathur/php/php@5.6", trusted: true
brew "shivammathur/php/php@7.0", trusted: true
brew "shivammathur/php/php@8.4", trusted: true

tap "shivammathur/extensions", trusted: true
brew "shivammathur/extensions/ssh2@8.4", trusted: true
